# Ultralytics YOLOv5 🚀, AGPL-3.0 license
# Parameters
nc: 6 # number of classes
depth_multiple: 0.33 # model depth multiple
width_multiple: 0.25 # layer channel multiple
# Optimized Anchor Box
anchors:
  - [9, 13, 14, 16, 12, 21, 21, 14]  # Small scale (P3)
  - [13, 28, 19, 23, 29, 17, 13, 40]  # Medium scale (P4)
  - [22, 33, 30, 27, 45, 19, 41, 44]  # Large scale (P5)

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]], # 0-P1/2
   [-1, 1, SPDConv, [128]], # 1-P2/4
   [-1, 3, RCSOSA, [128]],
   [-1, 1, SPDConv, [256]], # 3-P3/8
   [-1, 6, RCSOSA, [256]],
   [-1, 1, SPDConv, [512]], # 5-P4/16
   [-1, 9, RCSOSA, [512]],
   [-1, 1, SPDConv, [1024]], # 7-P5/32
   [-1, 1, C3_GhostDynamicConv, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 9
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, C3_GhostDynamicConv, [256, 1, 1]],  # 10, Y5, lateral_convs.0
  [-1, 1, nn.Upsample, [None, 2, 'nearest']],

  [6, 1, Conv, [256, 1, 1, None, 1, 1, False]],  # 12 input_proj.1
  [[-2, -1], 1, Concat, [1]],
  [-1, 3, C3_MLCA, [256]],  # 14, fpn_blocks.0
  [-1, 1, Conv, [256, 1, 1]],  # 15, Y4, lateral_convs.1

  [-1, 1, nn.Upsample, [None, 2, 'nearest']],
  [4, 1, Conv, [256, 1, 1, None, 1, 1, False]],  # 17 input_proj.0
  [[-2, -1], 1, Concat, [1]],  # cat backbone P4
  [-1, 3, C3_MLCA, [256]],  # X3 (19), fpn_blocks.1

  [-1, 1, Conv, [256, 3, 2]],  # 220, downsample_convs.0
  [[-1, 15], 1, Concat, [1]],  # cat Y4
  [-1, 3, C3_MLCA, [256]],  # F4 (22), pan_blocks.0

  [-1, 1, Conv, [256, 3, 2]],  # 25, downsample_convs.1
  [[-1, 10], 1, Concat, [1]],  # cat Y5
  [-1, 3, C3_MLCA, [256]],  # F5 (25), pan_blocks.1

  [[19, 22, 25], 1, Detect, [nc, anchors]], # Detect(P3, P4, P5)
  ]
